---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketch
source: html/f43a656c-5809-a8df-da09-5fe712a007a3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketch Property

Sketch is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSketch { get; }
```